Autodesk.Revit.DB.SpatialElementGeometryResults.GetBoundaryFaceInfo(Autodesk.Revit.DB.Face)
Query the spatial element boundary face information with the given face.
face:
The face from the spatial element's geometry.
Returns:
Sub-faces related to the room bounding elements that define the spatial element face. Returns null if there is no corresponding boundary information with the given face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryResults.GetGeometry
The solid from the spatial element.
Returns:
Requested solid.
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryResults.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SpatialElementGeometryResults
The results of spatial element geometry calculation.
Remarks:
The subfaces of a SpatialElement at the base height and top height are not associated with floors, roofs, and ceilings at the same height.
Since:
2012